/* テスト
-------------------------------------------------------------------------------*/
function Test () {
    this.init();
}

Test.prototype = {

    /* 初期化
    -------------------------------------------------------------------------------*/
    init: function (_appName) {
    }

    /* テスト実行
    -------------------------------------------------------------------------------*/
    go: function (_name, _callBack) {
        try {
           _callBack();
           return true;
        }
        catch (_error) {
            return false;
        }
    }


};